Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh95-v4.tmx
Source language: bo
Languages: en

source: །ཀླུའི་རྒྱལ་པོ་དེ་དག་གིས་ཀྱང་ཇི་ལྟར་ཉིན་བདུན་མཚན་བདུན་དུ་དེ་བཞིན་གཤེགས་པའི་སྐུ་དེ་ལ་རེག་པར་གྱུར་པ་དེ་ལྟ་བུའི་བདེ་བ་དེ་དག་གིས་སྔོན་ནམ་ཡང་མ་རྙེད་དོ།
en: Those nāga kings had never before known such bliss as during these seven days and seven nights, because of being close to the Thus-Gone One’s body.

source: །དེ་ནས་ཞག་བདུན་འདས་ནས་ཀླུའི་རྒྱལ་པོ་དེ་དག་གིས་ཡུལ་ངན་མེད་པར་ཤེས་ཏེ། དེ་བཞིན་གཤེགས་པའི་སྐུ་ལས་ལུས་བཀྲོལ་ནས།
en: When seven days had passed, the nāga kings understood that the bad weather had let up, and so they unfurled their bodies from the Thus-Gone One’s body.

source: དེ་བཞིན་གཤེགས་པའི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ཏེ། ལན་གསུམ་བསྐོར་བ་བྱས་ནས། རང་རང་གི་གནས་སུ་དོང་ངོ་།
en: They then bowed their heads at the feet of the Thus-Gone One, circumambulated him three times, and returned to their respective homes.

source: །ཀླུའི་རྒྱལ་པོ་བཏང་བཟུང་ཡང་དེ་བཞིན་གཤེགས་པའི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ཏེ། ལན་གསུམ་བསྐོར་བ་བྱས་ནས་རང་གི་གནས་སུ་ཞུགས་སོ།
en: The nāga king Mucilinda also bowed his head to the feet of the Thus-Gone One, circumambulated him three times, and then set out for his domain.

source: །ཞག་བདུན་པ་དྲུག་པའི་ཚེ་ནི་དེ་བཞིན་གཤེགས་པ་ཀླུའི་རྒྱལ་པོ་བཏང་བཟུང་གི་གནས་ནས་ཤིང་ནྱ་གྲོ་དྷ་ར་སྐྱོང་གི་དྲུང་དུ་བཞུད་དོ།
en: During the sixth week, the Thus-Gone One proceeded from the nāga king Mucilinda’s domain to a banyan tree of a goat herder.

source: །ཀླུའི་རྒྱལ་པོ་བཏང་བཟུང་གི་གནས་དང་ཤིང་ནྱ་གྲོ་དྷ་ར་སྐྱོང་གི་བར་དུ་རླུང་ནཻ་རན་ཛ་ནའི་ངོགས་སུ་སྤྱོད་པ་པ་དང་། ཀུན་ཏུ་རྒྱུ་དང་། ཉན་ཐོས་རྒན་པོ་དང་། གཽ་ཏ་མ་དང་། གཅེར་བུ་པ་དང་། ཀུན་དུ་འཚོ་བ་པ་ལ་སོགས་པས་དེ་བཞིན་གཤེགས་པ་མཐོང་ནས།
en: On the way, on the bank of the Nairañjanā River between the nāga king Mucilinda’s domain and the goat herder’s banyan tree, the Thus-Gone One was spotted by some carakas, parivrājakas, vṛddhaśrāvakas, gautamas, nirgranthas, ājīvikas, and others as well.

source: བཅོམ་ལྡན་འདས་གཽ་ཏ་མས་ཞག་བདུན་པ་ཡུལ་ངན་ཆེན་པོའི་དུས་འདི་བདེ་བས་བདེ་བར་འདས་པར་བྱས་སམ་ཞེས་འཛེར་ཏོ།
en: They asked him, “Blessed One, did Gautama fare happily during the unseasonable seven-day storm?”

source: །དགེ་སློང་དག་དེ་ནས་དེ་བཞིན་གཤེགས་པས་དེའི་ཚེ་ཆེད་དུ་རྗོད་པ་འདི་ཆེད་དུ་བརྗོད་དོ།
en: Monks, at that time the Thus-Gone One spoke these meaningful words: “Happy is the solitude of the contented one

source: །ཆོས་ཐོས་པ་དང་མཐོང་བ་དང་།
en: Who has heard the Dharma and can see.

source: །དབེན་པར་དགའ་བ་བདེ་བ་ཡིན།
en: Happy is the abstention from injury, in this world,

source: །སྲོག་ཆགས་འབྱུང་པོ་རྣམས་ལ་བསྡམས།
en: Of the one restrained toward living beings.

source: །གནོད་པ་མི་བྱེད་འཇིག་རྟེན་བདེ།
en: “Happy is the freedom from desire

source: །སྡིག་པ་རྣམས་ལས་རབ་འདས་པ།
en: That transcends evil.

source: །འདོད་ཆགས་བྲལ་བ་འཇིག་རྟེན་བདེ། །ང་སྙམ་ང་རྒྱལ་གང་འདུལ་བ། །
en: Happy is the subjugation of selfishness and pride.

source: དེ་ནི་མཆོག་ཏུ་བདེ་བ་ཡིན།
en: These are indeed the supreme forms of happiness!”

source: །དགེ་སློང་དག་དེ་བཞིན་གཤེགས་པས་སྐྱེ་བ་དང་། རྒ་བ་དང་། ན་བ་དང་། འཆི་བ་དང་། མྱ་ངན་དང་། སྨྲེ་སྔགས་འདོན་པ་དང་། སྡུག་བསྔལ་བ་དང་། ཡིད་མི་བདེ་བ་དང་། འཁྲུག་པ་རྣམས་ཀྱི་འཇིག་རྟེན་ཀུན་དུ་འབར་ཞིང་རབ་ཏུ་འབར་བར་གཟིགས་ནས་དེའི་ཚེ་བཅོམ་ལྡན་འདས་ཀྱིས་ཆེད་དུ་རྗོད་པ་འདི་ཆེད་དུ་བརྗོད་དོ།
en: Monks, seeing the world ablaze with birth, old age, sickness, death, anguish, lamentation, suffering, discontent, and strife, the Thus-Gone One next uttered this meaningful verse:

source: །སྒྲ་རེག་རོ་དང་གཟུགས་དང་དྲི་རྣམས་ཀྱིས། ། འཇིག་རྟེན་འདི་ནི་ཀུན་དུ་གདུངས་པར་གྱུར། །སྲིད་པས་འཇིགས་ཀྱང་སྲིད་པའི་སྲེད་པ་ཡིས། །ཕྱིར་ཞིང་སྲེད་པ་ཚོལ་བར་བྱེད་པ་ཡིན།
en: “This world is tormented By sounds, sensations, tastes, forms, and smells. Even while frightened of existence, Due to craving after existence, beings continue to pursue existence.”

source: །ཞག་བདུན་པ་བདུན་པའི་ཚེ་ནི་དེ་བཞིན་གཤེགས་པ་ཤིང་སྒྲོལ་རྒྱུའི་དྲུང་དུ་བཞུགས་སོ།
en: During the seventh week, the Thus-Gone One sat at the trunk of a bodhi tree.

source: །དེའི་ཚེ་བྱང་ཕྱོགས་པའི་ཚོང་པ་ག་གོན་དང་བཟང་པོ་ཞེས་བྱ་བ་མཁས་པ་གསལ་བ་སྤུན་གཉིས་རྙེད་པ་ཆེན་པོ་རྙེད་ནས། ཟོང་རྣམ་པ་མང་པོ་ཐོགས་ཏེ། འགྲོན་པ་ཕལ་པོ་ཆེ་དང་། ཤིང་རྟ་ཤིན་ཏུ་གང་བ་ལྔ་བརྒྱ་དང་ལྷན་ཅིག་ཏུ་ལྷོ་ཕྱོགས་ནས་བྱང་ཕྱོགས་སུ་དོང་ངོ་།
en: During that time, two learned and clever merchant brothers from the north, Trapuṣa and Bhallika, were traveling back from the south, after having gained much profit, with a caravan of five hundred fully loaded carts carrying many kinds of merchandise.

source: །དེ་གཉིས་ལ་གླང་བུ་ཅང་ཤེས་ལེགས་སྐྱེས་དང་གྲགས་པ་ཞེས་བྱ་བ་གཉིས་ཡོད་དོ།
en: They had two bullocks called Sujāta and Kīrti.

source: །དེ་གཉིས་ལ་ཐོགས་པའི་འཇིགས་པ་མེད་དེ་གང་དུ་གླང་བུ་གཞན་མི་ཐར་བ་དེར་དེ་གཉིས་གཏོང་ངོ་།
en: These two bulls had no fear of being waylaid, and thus they could be employed where no other bullocks would pass.

source: །གང་དུ་མདུན་རོལ་ན་འཇིགས་པ་ཡོད་པ་དེར་དེ་གཉིས་ཕུར་པ་ལ་བཏགས་པ་བཞིན་དུ་འདུག་གོ།
en: Wherever there was a threat, they would stand as though fastened to stakes.

source: །དེ་གཉིས་ལ་ལྕག་གིས་མི་འཇུའི་མེ་ཏོག་ཨུད་པ་ལ་སྤར་གང་ངམ། སྣ་མའི་མེ་ཏོག་གི་ཕྲེང་བས་དེ་གཉིས་དེད་དོ།
en: They could not be goaded by a whip, but only by handfuls of lotus flowers, or garlands of jasmine flowers.

source: །ཤིང་སྒྲོལ་རྒྱུ་དང་ཉེ་བ་ཞིག་ཏུ་ཤིང་འོ་མ་ཅན་གྱི་ནགས་ན་གནས་པའི་ལྷ་མོས་བྱིན་གྱི་རླབས་ཀྱིས་བྱིན་གྱིས་བརླབས་པས། དེ་དག་གི་ཤིང་རྟ་དེ་དག་ཐམས་ཅད་མི་འགྲོ་སྟེ།
en: When this caravan of merchants approached the Bodhi tree, a goddess who lived in a forest of milk trees enchanted all the carriages, thus rendering them motionless.

source: འབྲེང་པ་ལ་སོགས་པ་ཤིང་རྟའི་ཆ་རྐྱེན་ཐམས་ཅད་ཀྱང་ཆད་གྲུགས་སོ། །ཤིང་རྟའི་འཕང་ལོ་རྣམས་ཀྱང་ལྟེ་བ་ལ་ཐུག་པར་སའི་ནང་དུ་ནུབ་སྟེ།
en: All the parts of the carriages, such as the harnesses and the rest, tore and split, and the wheels of the carriages sunk into the ground up to their axles.

source: ཐམས་ཅད་ཀྱིས་རབ་ཏུ་བསྒྲིམས་ཀྱང་ཤིང་རྟ་དེ་དག་འགྲོ་བར་མ་གྱུར་ནས།
en: Even with everyone making great effort, the carts would move no farther.

source: ཁ་ཅིག་ངོ་མཚར་དང་སྐྲག་པར་གྱུར་ཏེ། ཤིང་རྟ་འདི་དག་ཐང་ལ་ཡང་ཐོགས་པར་གྱུར་པ་འདི་ལ་རྒྱུ་ནི་ཅི་ཞིག་ཡོད།
en: Shocked and frightened, the members of the caravan thought, “Why have the carriages stopped here on this plain?

source: འདིའི་འགྱུར་བ་ནི་ཅི་ཞིག་ཡིན་སྙམ་ནས།
en: What has happened?”

source: དེ་དག་གིས་གླང་བུ་ལེགས་སྐྱེས་དང་གྲགས་པ་དེ་གཉིས་འདྲེན་དུ་བཅུག་སྟེ། མེ་ཏོག་ཨུད་པ་ལ་སྤར་གང་དང་། སྣ་མའི་མེ་ཏོག་གི་ཕྲེང་བས་བདས་ཀྱང་འགྲོ་བར་མ་གྱུར་ནས་དེ་དག་འདི་སྙམ་དུ་སེམས་ཏེ།
en: They brought out the two bullocks Sujāta and Kīrti, but they also would move no farther, even though they were goaded with bunches of lotuses and garlands of jasmine.

source: གང་གི་ཕྱིར་འདི་གཉིས་ཀྱང་མི་འགྲོ་བ་ལས་མདུན་ན་འཇིགས་པ་འགའ་ཞིག་འབྱུང་དུ་གདོན་མི་ཟའོ་སྙམ་ནས།
en: So the merchants thought, “Since even these two animals will not move, there certainly must be some threat up ahead.”

source: དེ་དག་གིས་ས་འཁྲུ་བ་རྟ་པ་དག་སྔར་བཏང་ངོ་།
en: Thus they dispatched scouts on horseback.

source: །ས་འཁྲུ་བ་རྟ་པ་རྣམས་སླར་ལོག་ནས་འཇིགས་པ་ཅི་ཡང་མེད་ཅེས་སྨྲས་སོ།
en: When the scouts returned, they reported, “There is no threat whatsoever.”

source: །ལྷ་མོ་དེས་ཀྱང་རང་གི་གཟུགས་བསྟན་ནས་མ་འཇིགས་ཤིག་ཅེས་དབུགས་ཕྱུང་ངོ་།
en: The goddess then revealed her form and consoled the members of the caravan, saying, “Do not fear!”

source: །གླང་བུ་དེ་གཉིས་ཀྱིས་དེ་བཞིན་གཤེགས་པ་ག་ལ་བ་དེ་ལོགས་སུ་ཤིང་རྟ་དྲངས་པ་དང་། དེ་དག་གིས་དེ་བཞིན་གཤེགས་པ་མེ་ལྟར་རབ་ཏུ་འབར་བ་སྐྱེས་བུ་ཆེན་པོའི་མཚན་སུམ་ཅུ་རྩ་གཉིས་ཀྱི་མཚན་གྱིས་ལེགས་པར་བརྒྱན་པ། ཉི་མ་ཤར་ནས་རིང་པོར་མ་ལོན་པ་ལྟ་བུ་དཔལ་གྱིས་འབར་བ་མཐོང་ངོ་།
en: Now the two bullocks could lead the carts to where the Thus-Gone One was. When they arrived, they saw the Thus-Gone One blazing like the god of fire, well adorned with the thirty-two marks of a great being, shining with splendor, like the sun just after dawn.

source: །མཐོང་ནས་ཀྱང་དེ་དག་ངོ་མཚར་དུ་གྱུར་ཏེ། འདི་ནི་ཅི་ཞིག་ཚངས་པ་འདིར་ཕྱིན་ཏམ།
en: Seeing him, the merchants were amazed and thought, “Is this Brahmā who has come here?

source: འོན་ཏེ་ལྷའི་དབང་པོ་བརྒྱ་བྱིན་ནམ། འོན་ཏེ་རྣམ་ཐོས་ཀྱི་བུའམ།
en: Or is it Śakra, lord of the gods?

source: འོན་ཏེ་ཉི་མ་དང་ཟླ་བའམ།
en: Or is it Vaiśravaṇa, or perhaps the sun or the moon?

source: འོན་ཏེ་རིའི་ལྷ་འགའ་ཞིག་གམ། རླུང་གི་ལྷ་འགའ་ཞིག་སྙམ་མོ།
en: Or is it some mountain god, or some river god?”

source: །དེ་ནས་དེ་བཞིན་གཤེགས་པས་ན་བཟའ་ངུར་སྨྲིག་རྣམས་བསྟན་ཏོ། །དེ་ནས་དེ་དག་གིས་ངུར་སྨྲིག་བགོས་པ་འདི་ནི་རབ་ཏུ་བྱུང་བ་ཡིན་གྱིས་བདག་ཅག་འཇིགས་པ་མེད་དོ་ཞེས་སྨྲས་ཏེ། །དེ་དག་དད་པ་ཐོབ་ནས་ཡང་ཕན་ཚུན་དུ་སྨྲས་པ། རབ་ཏུ་བྱུང་བ་འདི་ནི་དུས་སུ་ཟ་བ་ཡིན་ན།
en: The Thus-Gone One then revealed his saffron robes, and so the merchants said, “This person in saffron-colored robes is a renunciant, so he is no threat to us.” They had in fact developed devotion to him, and so they said among themselves, “It must be mealtime for this renunciant.

source: ཅུང་ཟད་ཅི་ཡོད།
en: What morsels do we have?”

source: སྨྲས་པ། སྦྲང་རྩི་དང་། སྐྱོ་མ་དང་། བུ་རམ་ཤིང་བཤུས་པ་ཡོད་དོ།
en: A few members of the caravan said, “There is honey, gruel, and stripped sugar cane.”

source: །དེ་དག་གིས་སྦྲང་རྩི་དང་། སྐྱོ་མ་དང་། བུ་རམ་ཤིང་བཤུས་པ་ཁྱེར་ནས། དེ་བཞིན་གཤེགས་པ་ག་ལ་བ་དེར་དོང་སྟེ་ཕྱིན་པ་དང་། དེ་བཞིན་གཤེགས་པའི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ཏེ། ལན་གསུམ་བསྐོར་བ་བྱས་ནས་ཕྱོགས་གཅིག་ཏུ་འཁོད་དོ། །ཕྱོགས་གཅིག་ཏུ་འཁོད་ནས་ཀྱང་དེ་དག་གིས་དེ་བཞིན་གཤེགས་པ་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ།
en: So, carrying the honey, gruel, and stripped sugar cane, they went to where the Thus-Gone One was seated, bowed down their heads to his feet, circumambulated him three times, and stood to one side.

source: །བཅོམ་ལྡན་འདས་བདག་ཅག་ལ་ཐུགས་བརྩེ་བར་དགོངས་ཏེ་སྤྱན་གཟིགས་འདི་བཞེས་སུ་གསོལ།
en: Then they requested the Thus-Gone One, “Please regard us with compassion and accept these alms!”

source: དགེ་སློང་དག་དེ་ནས་དེ་བཞིན་གཤེགས་པ་འདི་སྙམ་དུ་དགོངས་ཏེ།
en: Monks, the Thus-Gone One then wondered,

source: བདག་གིས་ལག་པས་འདི་བླངས་ན་ནི་མ་ལེགས་ན་སྔོན་གྱི་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རྣམས་ཀྱིས་སྣོད་ཇི་ལྟ་བུས་བཞེས་སྙམ་ནས་མཁྱེན་པ་འཇུག་པར་གྱུར་ཏོ།
en: “It would not be appropriate for me to take these alms with my hands. What vessel did the previous perfect and complete awakened ones use to accept alms?” Right then the answer dawned on him.

source: །དགེ་སློང་དག་དེ་ལྟར་དེ་བཞིན་གཤེགས་པའི་སྐབས་ཀྱི་དུས་ལ་བབ་པར་རིག་ནས་སྐད་ཅིག་དེ་ཉིད་ལ་ཕྱོགས་བཞི་ནས་རྒྱལ་པོ་ཆེན་པོ་བཞི་གསེར་གྱི་ལྷུང་བཟེད་བཞི་ཐོགས་ཏེ།
en: Monks, knowing that it was time for the Thus-Gone One to eat, at that very moment the Four Great Kings appeared from the four directions carrying four golden alms bowls.

source: ལྷགས་ནས་དེ་བཞིན་གཤེགས་པ་ལ་བཅོམ་ལྡན་འདས་བདག་ཅག་ལ་ཐུགས་བརྩེ་བར་དགོངས་ཏེ། གསེར་གྱི་ལྷུང་བཟེད་བཞི་པོ་འདི་དག་བཞེས་སུ་གསོལ་ཞེས་ཕུལ་ལོ།
en: They offered them to the Thus-Gone One, saying to him, “Please regard us with compassion and accept these four golden alms bowls!”

source: །དེ་དག་དགེ་སྦྱོང་གི་ཆ་མ་ཡིན་པར་དགོངས་ནས། དེ་བཞིན་གཤེགས་པས་མ་བཞེས་སོ།
en: Thinking, however, that those bowls were not appropriate for a monk, the Thus-Gone One did not accept them.

source: །དེ་བཞིན་དུ་དངུལ་གྱི་བཞི་དང་། བཻ་དཱུརྱའི་དང་། ཤེལ་དང་། སྤུག་དང་། རྡོའི་སྙིང་པོ་ལས་བྱས་པ་བཞི་བཞི་དང་། རིན་པོ་ཆེ་ཐམས་ཅད་ལས་བྱས་པའི་ལྷུང་བཟེད་བཞི་ཐོགས་ཏེ།
en: So the four kings came back with four alms bowls made of silver, four made of beryl, four made of quartz, four made of coral, four made of emerald, and four made of every gem.

source: དེ་བཞིན་གཤེགས་པ་ལ་ཕུལ་ན་ཡང་དགེ་སྦྱོང་གི་ཆ་མ་ཡིན་པར་དགོངས་ཏེ། དེ་བཞིན་གཤེགས་པས་མ་བཞེས་སོ།
en: They offered them to the Thus-Gone One, but he declined, thinking that these were all inappropriate for a monk.

source: །དགེ་སློང་དག་དེ་ནས་དེ་བཞིན་གཤེགས་པས་ཡང་འདི་སྙམ་དུ་དགོངས་ཏེ། སྔོན་གྱི་དེ་བཞིན་གཤེགས་པ་རྣམས་ཀྱིས་ལྷུང་བཟེད་རྣམ་པ་ཅི་འདྲ་བ་དག་གིས་བཞེས་སྙམ་དགོངས་ན། རྡོའི་ལྷུང་བཟེད་རྣམས་ཀྱིས་བཞེས་པར་མཁྱེན་ནས།
en: Monks, the Thus-Gone One then wondered what kind of alms bowls the previous thus-gone ones had used to accept alms. He understood that it was alms bowls made of stone, and so that thought dawned in the Thus-Gone One’s mind.

source: དེ་བཞིན་གཤེགས་པས་དེ་ལྟ་བུའི་ཐུགས་བསྐྱེད་པ་དང་། དེ་ནས་རྒྱལ་པོ་ཆེན་པོ་རྣམ་ཐོས་ཀྱི་བུས་རྒྱལ་པོ་ཆེན་པོ་གཞན་གསུམ་ལ་སྨྲས་པ། གྲོགས་པོ་དག་སྔོན་པོའི་རིས་ཀྱི་ལྷའི་བུ་རྣམས་ཀྱིས་བདག་ལ་རྡོའི་ལྷུང་བཟེད་བཞི་བྱིན་པ་དང་། དེ་ལ་བདག་གིས་འདི་སྙམ་དུ་བསམས་ཏེ། །འདི་སྤྱད་པར་བྱའོ་སྙམ་པ་དང་། དེ་ནས་སྔོན་པོའི་རིས་ཀྱི་ལྷའི་བུ་རྣམ་པར་སྣང་བྱེད་ཅེས་བྱ་བ་དེས་བདག་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ།
en: Then the great king Vaiśravaṇa said to the three other great kings, “Friends, when the gods of the blue class gave us four stone alms bowls, we thought that they were for our use. But a god of the blue realm called Vairocana told us the following:

source: །ཀྱེ་སྣོད་འདི་དག་སྤྱད་པར་མ་བྱ་བར།
en: “ ‘Listen, these alms bowls are not to be used. Preserve them!

source: །འདི་དག་ཆོངས་ཤིག་མཆོད་རྟེན་གྲགས་པར་འགྱུར།
en: They will become honored as sacred objects.

source: །ཤཱཀྱ་ཐུབ་ཅེས་བྱ་བའི་རྒྱལ་བ་འབྱུང་།
en: A victorious one called Śākyamuni will appear;

source: །དེ་ལ་ལྷུང་བཟེད་འདི་དག་དབུལ་བ་གྱིས།
en: Offer these alms bowls to him!’

source: །གྲོགས་པོ་དག་གིས་ཤཱཀྱ་ཐུབ་པ་ལ། །སྣོད་དབུལ་བ་ཡི་དུས་དང་ཚོད་ལ་བབ།
en: “Friends, the time has now come To offer a vessel to Śākyamuni.

source: །གླུ་དབྱངས་དག་དང་སིལ་སྙན་སྒྲ་ཕྱུང་སྟེ།
en: Paying homage with the melodious sound of song and cymbals,

source: །མཆོད་པ་བྱས་ནས་ལྷུང་བཟེད་དབུལ་བར་བྱ།
en: We will offer the begging bowls.

source: །སྣོད་དེ་ཆོས་ཀྱི་རང་བཞིན་མི་ཤིགས་པ།
en: “He is a vessel made of Dharma and is indestructible,

source: །སྣོད་འདི་རྡོ་བའི་རང་བཞིན་བཞེས་སུ་རུང་།
en: While these vessels, made of stone, are destructible.

source: །གཞན་གྱིས་བླང་བར་བཟོད་པ་མ་ཡིན་གྱིས།
en: He will be unable to accept another bowl;

source: །ད་ནི་བདག་ཅག་དེ་དག་ལེན་དུ་འདོང་།
en: Let’s go so that he can accept them!”

source: །དེ་ནས་རྒྱལ་པོ་ཆེན་པོ་བཞིས་རང་གི་གཉེན་དང་འཁོར་དུ་བཅས་ཏེ་མེ་ཏོག་དང་། བདུག་པ་དང་། སྤོས་དང་། ཕྲེང་བ་དང་། བྱུག་པ་དང་། སིལ་སྙན་དང་། ཕེག་རྡོབ་པ་དང་། གླུ་དབྱངས་ལེན་ཅིང་རང་རང་གི་ལག་ཏུ་ལྷུང་བཟེད་དེ་དག་ཐོགས་ནས། དེ་བཞིན་གཤེགས་པ་ག་ལ་བ་དེར་སོང་སྟེ་ཕྱིན་ནས།
en: Then the four kings, together with their kinfolk and retainers, went to the Thus-Gone One holding those alms bowls in their hands and carrying flowers, incense, perfumes, garlands, and unguents, playing cymbals and gongs, and singing songs.

source: དེ་བཞིན་གཤེགས་པ་ལ་མཆོད་པ་བྱས་ཏེ། ལྷུང་བཟེད་དེ་དག་ལྷའི་མེ་ཏོག་གིས་བཀང་ནས་དེ་བཞིན་གཤེགས་པ་ལ་ཕུལ་ལོ།
en: Having paid homage to the Thus-Gone One, they filled the alms bowls with divine flowers and offered them to the Thus-Gone One.

source: །དགེ་སློང་དག་དེ་ནས་དེ་བཞིན་གཤེགས་པ་འདི་སྙམ་དུ་དགོངས་ཏེ། རྒྱལ་པོ་ཆེན་པོ་དད་པ་དང་ལྡན་པ་བཞི་པོ་འདི་དག་གིས་བདག་ལ་རྡོའི་ལྷུང་བཟེད་བཞི་ཕུལ་ན།
en: Monks, the Thus-Gone One then thought, “These four devoted great kings are giving me four stone alms bowls.

source: བདག་ལ་ནི་བཞིར་མི་རུང་ལ།
en: But four are too many for me.

source: ཇི་སྟེ་གཅིག་གི་བླངས་ན་ནི་གསུམ་ཡང་མི་དགའ་བར་འགྱུར་ན།
en: Yet if I were to accept only one, the other three would be upset.

source: །བདག་གིས་ལྷུང་བཟེད་བཞི་པོ་འདི་དག་བླངས་ཏེ་ལྷུང་བཟེད་གཅིག་ཏུ་བྱིན་གྱིས་བརླབ་བོ་སྙམ་མོ།
en: So I will take all four alms bowls and transform them into one.”

source: །དགེ་སློང་དག་དེ་ནས་དེ་བཞིན་གཤེགས་པས་ཕྱག་གཡས་པ་བརྐྱང་སྟེ། རྒྱལ་པོ་ཆེན་པོ་རྣམ་ཐོས་ཀྱི་བུ་ལ་ཚིགས་སུ་བཅད་པས་བཀའ་སྩལ་པ།
en: Monks, the Thus-Gone One then extended his right hand and spoke to the great king Vaiśravaṇa in verse:

source: བདེ་བར་གཤེགས་ལ་ལྷུང་བཟེད་ཕུལ་ཅིག་དང་། །ཁྱོད་ནི་ཐེག་པ་མཆོག་གི་སྣོད་དུ་འགྱུར།
en: “Offer an alms bowl to the Well-Gone One! You will become a vessel of the Supreme Vehicle.

source: །ང་འདྲ་དག་ལ་ལྷུང་བཟེད་ཕུལ་བ་ནི།
en: By offering an alms bowl to the likes of me,

source: །དྲན་དང་བློ་གྲོས་ནམས་ཀྱང་ཉམས་མི་འགྱུར།
en: You will never be bereft of mindfulness and intelligence.”

source: །དགེ་སློང་དག་དེ་ནས་དེ་བཞིན་གཤེགས་པས་ཐུགས་བརྩེ་བར་དགོངས་ཏེ། རྒྱལ་པོ་ཆེན་པོ་རྣམ་ཐོས་ཀྱི་བུ་ལས་ལྷུང་བཟེད་བཞེས་སོ།
en: Monks, the Thus-Gone One then accepted the alms bowl from the great king Vaiśravaṇa, regarding him with compassion.

source: །བཞེས་ནས་ཀྱང་རྒྱལ་པོ་ཆེན་པོ་ཡུལ་འཁོར་སྲུང་ལ་ཚིགས་སུ་བཅད་པས་བཀའ་སྩལ་པ།
en: Having thus accepted it, he then spoke in verse to the great king Dhṛtarāṣṭra:

source: གང་ཞིག་དེ་བཞིན་གཤེགས་ལ་ལྷུང་བཟེད་ཕུལ།
en: “Whoever gives an alms bowl to the Thus-Gone One

source: །ནམས་ཀྱང་དྲན་དང་ཤེས་རབ་ཉམས་མི་འགྱུར།
en: Will never be bereft of mindfulness and insight,

source: །བསིལ་དངོས་གོ་འཕང་སངས་རྒྱས་ཐོབ་བར་དུ། །བདེ་བས་བདེ་བར་དུས་རྣམས་ཟད་པར་བྱེད།
en: And will spend his time happily at ease Until awakening to the state of cool repose.”

source: །དགེ་སློང་དག་དེ་ནས་དེ་བཞིན་གཤེགས་པས་ཐུགས་བརྩེ་བར་དགོངས་ཏེ། རྒྱལ་པོ་ཆེན་པོ་ཡུལ་འཁོར་སྲུང་ལས་ལྷུང་བཟེད་བཞེས་སོ།
en: Monks, the Thus-Gone One then accepted the begging bowl from the great king Dhṛtarāṣṭra, regarding him with compassion.

source: །བཞེས་ནས་ཀྱང་རྒྱལ་པོ་ཆེན་པོ་འཕགས་སྐྱེས་པོ་ལ་ཚིགས་སུ་བཅད་པས་བཀའ་སྩལ་པ།
en: Having accepted it, he spoke in verse to the great king Virūḍhaka:

source: རྣམ་པར་དག་སེམས་དེ་བཞིན་གཤེགས་པ་ལ། །ཁྱོད་ཀྱིས་ཡོངས་དག་ལྷུང་བཟེད་ཕུལ་ཅིག་དང་། །ཁྱོད་ཀྱི་སེམས་ནི་མྱུར་དུ་དག་པར་འགྱུར། །ལྷ་མི་འཇིག་རྟེན་དག་ན་བསྔགས་པར་འོས།
en: “Give a pristine begging bowl To the Thus-Gone One, pure in mind, And you will swiftly become pure in mind, Worthy of veneration in the world.”

source: །དགེ་སློང་དག་དེ་ནས་དེ་བཞིན་གཤེགས་པས་ཐུགས་བརྩེ་བར་དགོངས་ཏེ། རྒྱལ་པོ་ཆེན་པོ་འཕགས་སྐྱེས་པོ་ལས་ལྷུང་བཟེད་བཞེས་སོ།
en: Monks, the Thus-Gone One then accepted the alms bowl from the great king Virūḍhaka, regarding him with compassion.

source: །བཞེས་ནས་ཀྱང་རྒྱལ་པོ་ཆེན་པོ་མིག་མི་བཟང་ལ་ཚིགས་སུ་བཅད་པས་བཀའ་སྩལ་པ།
en: Having accepted it, he spoke to the great king Virūpākṣa in verse:

source: །སྐྱོན་མེད་སེམས་དང་དད་པས་སྐྱོན་མེད་སྣོད། །དེ་བཞིན་གཤེགས་པ་ཚུལ་ཁྲིམས་སྐྱོན་མེད་ཅིང་། །ཚུལ་སྐྱོན་མེད་ལ་རབ་ཏུ་ཕུལ་ཅིག་དང་། །ཁྱོད་ཀྱི་སྦྱིན་པ་བསོད་ནམས་སྐྱོན་མེད་འགྱུར།
en: “Give, with faultless intention and devotion, A faultless vessel to the Thus-Gone One, Who is faultless in discipline and conduct, And your merit of generosity will be faultless.”

source: །དགེ་སློང་དག་དེ་བཞིན་གཤེགས་པས་ཐུགས་བརྩེ་བར་དགོངས་ཏེ། །རྒྱལ་པོ་ཆེན་པོ་མིག་མི་བཟང་ལས་ལྷུང་བཟེད་བཞེས་སོ།
en: Monks, the Thus-Gone One then accepted the alms bowl from the great king Virūpākṣa, regarding him with compassion.

source: །བཞེས་ནས་ཀྱང་མོས་པའི་སྟོབས་ཀྱི་ལྷུང་བཟེད་གཅིག་ཏུ་བྱིན་གྱིས་བརླབས་ཏེ། དེའི་ཚེ་ཆེད་དུ་བརྗོད་པ་འདི་ཆེད་དུ་བརྗོད་དོ།
en: When he had accepted it, he transformed all four alms bowls into one through the power of his wish, and then said this meaningful verse:

source: །ང་ཡིས་སྔོན་གྱི་སྲིད་པར་སྣོད་ཀྱི་རྣམས།
en: “Since, in a previous existence, I offered alms bowls,

source: །བཟང་བྱས་འབྲས་བུས་རབ་ཏུ་བཀང་སྟེ་བྱིན།
en: Filling them with fruit and making them lovely,

source: །དེ་ནས་ལྷུང་བཟེད་དབྱིབས་ལེགས་བཞི་པོ་འདི། །རྫུ་འཕྲུལ་ཆེན་པོའི་ལྷ་བཞི་རྣམས་ཀྱིས་བྱིན།
en: The four miraculous gods are now giving me These four well-formed alms bowls.”

source: །བརྟན་པ་དམ་པའི་དོན་དེ་དགོངས་པ་དེ།
en: This wise one, with insight into ultimate reality,

source: །ཞག་བདུན་བྱང་ཆུབ་ཤིང་མཆོག་གཟིགས་ནས་ནི།
en: Gazed at the supreme tree of awakening for seven nights.

source: །སེང་གེའི་སྟབས་འདྲ་མི་ཡི་སེང་གེ་དེ། །ས་ནི་རྣམ་པ་དྲུག་ཏུ་བསྐྱོད་ནས་བཞེངས།
en: The earth trembled in six ways, And then this lion among men rose, with the movements of a lion.

source: །གླང་པོའི་དབང་ལྟར་ཀུན་ཏུ་དལ་གྱིས་གཤེགས།
en: Like the lord of elephants, he slowly walked about,

source: །རིམ་གྱིས་སྒྲོལ་རྒྱུའི་ཤིང་གི་དྲུང་བྱོན་ནས།
en: And eventually reached the trunk of the tree of liberation.

source: །ལྷུན་པོ་ལྟ་བུར་གཡོ་བ་མི་མངའ་བཞུགས།
en: Like Mount Meru, the Sage sat there unshakable,

source: །ཐུབ་པ་བསམ་གཏན་ཏིང་ངེ་འཛིན་རྣམས་དགོངས།
en: Absorbed in concentration and meditation.

source: །དེ་ཡི་ཚེ་ན་ག་གོན་བཟང་པོ་སྤུན།
en: At that time the two brothers Trapuṣa and Bhallika,

source: །གཉིས་དང་ཚོང་པའི་ཚོགས་དང་ཤིང་རྟ་ནི།
en: With their caravan of merchants

source: །ནོར་གྱིས་གང་བ་དག་དང་ལྷན་ཅིག་ཏུ།
en: And carriages filled with riches,

source: །སཱ་ལའི་མེ་ཏོག་ནགས་ཚལ་རྒྱས་པར་ཞུགས།
en: Reached a grove of sāl trees in full bloom.

source: །དྲང་སྲོང་ཆེན་པོའི་གཟི་ཡིས་སྐད་ཅིག་ཏུ།
en: Instantly, through the Great Sage’s radiance,

source: །སྲོག་ཤིང་ཐུག་པར་འཕང་ལོ་ས་ནང་ནུབ།
en: The wheels sunk into the earth up to their axles.

source: །དེ་དག་དེ་འདྲ་བ་ཡི་གནས་མཐོང་ནས།
en: Seeing such a situation,

source: །ཚོང་པའི་ཚོགས་ནི་འཇིགས་པ་ཆེན་པོ་སྐྱེས།
en: The merchant caravan was terrified.

source: །དེ་དག་རལ་གྲི་མདའ་དང་མདུང་ཐུང་ཐོགས།
en: Carrying swords, arrows, and spears,

source: །ནགས་ན་རི་དགས་བཞིན་དུ་སུ་ཞེས་ཚོལ།
en: They inquired who was dwelling in the forest like a deer.

source: །སྤྲིན་མེད་འོད་ཟེར་སྟོང་ལྡན་འདྲ་བའི་རྒྱལ།
en: They saw the Victorious One, who was like the sun in a cloudless sky

source: །ཞལ་རས་སྟོན་གྱི་ཟླ་བ་འདྲ་བ་མཐོང་།
en: And whose face was like an autumn moon.

source: །ཁྲོ་བ་སྤངས་ཤིང་རྒྱགས་པ་བསལ་ནས་སུ།
en: Without hostility or pride,

source: །མགོ་བོས་ཕྱག་འཚལ་འདི་ནི་སུ་ཞེས་དཔྱོད།
en: They bowed down, wondering who he was.

source: །མཁའ་ལས་ལྷ་ཡིས་འདི་སྐད་ཚིག་སྨྲས་ཏེ།
en: A deity said from the sky,

source: །འདི་ནི་སངས་རྒྱས་འཇིག་རྟེན་ཕན་དོན་མཛད།
en: “He is a buddha acting for the welfare of the world.

source: །ཉིན་བདུན་མཚན་བདུན་བཟའ་དང་བཏུང་བ་དག །ཐུགས་རྗེའི་བདག་ཉིད་འདི་ནི་མ་གསོལ་ཏོ།
en: “For seven days and nights, This embodiment of compassion has not consumed food or drink.

source: །གལ་ཏེ་བདག་གི་ཉོན་མོངས་ཞི་འདོད་ན།
en: If you want to assuage your own afflictions,

source: །སྐུ་དང་ཐུགས་བསྒོམས་འདི་ལ་བཤོས་གསོལ་ཅིག །དེ་དག་གིས་ནི་སྒྲ་སྙན་དེ་ཐོས་ནས།
en: Feed this cultivated body and mind!” When they heard that sweet speech,

source: །རྒྱལ་ལ་ཕྱག་འཚལ་བསྐོར་བ་བྱས་ནས་ནི།
en: They bowed down to the Victorious One and circumambulated him.

source: །དགའ་ནས་དེ་དག་གྲོགས་དང་ལྷན་ཅིག་ཏུ། །རྒྱལ་བ་བཤོས་གསོལ་བར་ནི་གྲོས་བཅད་དོ།
en: Pleased, they decided with their companions To feed the Victorious One.

source: །དགེ་སློང་དག་དེའི་ཚེ་ཚོང་པ་ག་གོན་དང་བཟང་པོ་གཉིས་ཀྱི་བའི་ཁྱུ་མཐའ་འཁོབ་ཀྱི་འོར་ཞིག་ན་གནས་སོ།
en: Monks, at that time the herd of cows belonging to the merchants Trapuṣa and Bhallika was grazing at a neighboring village.

source: །དེ་ནས་དེའི་ཚེ་བ་དེ་དག་བཞོས་ནས་མར་གྱི་སྙིང་ཁུ་བྱུང་བར་གྱུར་ཏོ། །དེ་ནས་བ་ལང་རྫི་དེ་དག་གིས་མར་གྱི་སྙིང་ཁུ་དེ་ཁྱེར་ནས། ཚོང་པ་ག་གོན་དང་བཟང་པོ་ག་ལ་བ་དེར་སོང་སྟེ་ཕྱིན་ནས། དེ་དག་གིས་ཚུལ་སྨོས་ཏེ།
en: There the cows were milked and yielded clarified butter, which the herdsmen brought to the two merchants, Trapuṣa and Bhallika, saying,

source: བཙུན་པ་དག་མཁྱེན་པར་མཛད་དུ་གསོལ།
en: “O my lords, please advise us!

source: ཁྱེད་ཀྱི་བ་ཐམས་ཅད་ནི་བཞོས་ན།
en: When we milked all your cows, they yielded clarified butter.

source: མར་གྱི་སྙིང་ཁུ་བྱུང་ན་འདི་ཅི་དགེ་བ་ཞིག་ལགས་སམ།
en: Is this auspicious or not?”

source: འོན་ཏེ་མ་ལགས། དེ་ན་བྲམ་ཟེ་ཟས་ལ་བརྐམ་པའི་རང་བཞིན་ཅན་དག་འདི་སྐད་ཅེས་འདི་ནི་དགེ་བ་མ་ཡིན་ཏེ། བྲམ་ཟེ་རྣམས་ལ་མཆོད་སྦྱིན་ཆེན་པོ་བྱ་དགོས་སོ་ཞེས་འཛེར་ཏོ།
en: Some priests, who were gluttonous by nature, said, “It is inauspicious, so a grand offering of this butter should be made to the priests.”

source: །དགེ་སློང་དག་དེའི་ཚེ་ཚོང་པ་ག་གོན་དང་བཟང་པོ་དག་གི་ཚེ་རབས་སྔ་མའི་སྣག་གི་གཉེན་མཚམས་བྲམ་ཟེ་རྨ་བྱ་ཞེས་བྱ་བ་ཚངས་པའི་འཇིག་རྟེན་དུ་སྐྱེས་པར་གྱུར་པ་དེས་བྲམ་ཟེའི་གཟུགས་སུ་སྤྲུལ་ནས།
en: Monks, at that time, however, a priest named Śikhaṇḍī spoke. He had been a kinsman of the merchants Trapuṣa and Bhallika in a previous life. He had been reborn in the Brahma realm, and now manifested among them in the form of a young brahmin.

source: ཚོང་པ་དེ་དག་ལ་ཚིགས་སུ་བཅད་དེ་སྨྲས་པ།
en: He spoke the following verses to the merchants:

source: །ཁྱོད་ཀྱིས་སྔོན་ནི་སྨོན་བཏབ་པ།
en: “In the past you made the aspiration:

source: །བྱང་ཆུབ་བརྙེས་ནས་དེ་བཞིན་གཤེགས།
en: ‘When the Thus-Gone One reaches awakening,

source: །བདག་ཅག་རྣམས་ཀྱི་བཤོས་གསོལ་ཏེ།
en: May he partake of our food

source: །ཆོས་ཀྱི་འཁོར་ལོ་བསྐོར་བར་ཤོག །སྨོན་ལམ་དེ་ནི་རྫོགས་ཟིན་གྱིས།
en: And turn the wheel of Dharma!’ “This aspiration has now been fulfilled.

source: །བྱང་ཆུབ་བརྙེས་པ་དེ་བཞིན་གཤེགས།
en: The Thus-Gone One who reached awakening

source: །དེ་ལ་ཞལ་ཟས་ཕུལ་ཅིག་དང་། །གསོལ་ནས་འཁོར་ལོ་བསྐོར་བར་འགྱུར།
en: Should be offered this food. Once he has eaten, he will turn the wheel of Dharma.

source: །ཁྱེད་ཀྱི་བ་མར་སྙིང་ཁུ་བྱུང་།
en: “That your cows yielded clarified butter
